;-----------------------------------------------------------------
; Программа вывода сообщения на экран и ввода строки с клавиатуры
 ;-----------------------------------------------------------------
;------------------- Объявление переменных---------------
SECTION .data
 ; Секция инициированных данных
 msg: DB 'Введите строку:',10 ; сообщение плюс
 ; символ перевода строки
 msgLen: EQU $-msg
 ; Длина переменной 'msg'
 SECTION .bss
 buf1:
 ; Секция не инициированных данных
 RESB 80 ; Буфер размером 80 байт
 ;-------------------
 SECTION .text
 GLOBAL _start
 _start:
 ; Код программы
 ; Начало программы----------------
; Точка входа в программу
 ;------------ Cистемный вызов write
 ; После вызова инструкции 'int 80h' на экран будет
 ; выведено сообщение из переменной 'msg' длиной 'msgLen'
 mov eax,4
 mov ebx,1
 mov ecx,msg
 mov edx,msgLen
 int 80h
 ; Системный вызов для записи (sys_write)
 ; Описатель файла 1- стандартный вывод
 ; Адрес строки 'msg' в 'ecx'
 ; Размер строки 'msg' в 'edx'
 ; Вызов ядра
 ;------------ системный вызов read---------------------
; После вызова инструкции 'int 80h' программа будет ожидать ввода
 ; строки, которая будет записана в переменную 'buf1' размером 80 байт
 mov eax, 3
 mov ebx, 0
 mov ecx, buf1
 mov edx, 80
 int 80h
 ; Системный вызов для чтения (sys_read)
 ; Дескриптор файла 0- стандартный ввод
 ; Адрес буфера под вводимую строку
 ; Длина вводимой строки
 ; Вызов ядра
; Вывод введёной пользователем строки
mov	eax, 4
mov	edi, 1
mov	esi, buf1
mov	edx, 80
int 80h

 ;------------ Системный вызов exit---------------------
; После вызова инструкции 'int 80h' программа завершит работу
 mov eax,1
 mov ebx,0
 int 80h
 ; Выход с кодом возврата 0 (без ошибок)
 ; Вызов ядра
